## Intro to Machine Learning - Case Study-1

1. Data Loading:
a. Load the dataset “prisoners.csv” using pandas and display the first and last five rows in the dataset.
[Hint: Refer to read_csv, head and tail methods in pandas]
b. Use describe method in pandas and find out the number of columns. Can you say something about those rows who have zero inmates?
[Hint: Use the loc attribute of dataframe combined with conditional checks]
2. Data Manipulation:
a. Create a new column -’total_benefitted’ that is a sum of inmates benefitted through all modes.
[Hint: Use sum method with appropriate axis]
b. Create a new row - “totals” that is the sum of all inmates benefitted through each mode across all states.
3. Plotting:
a. Make a bar plot with each state name on the x -axis and their total benefitted inmates as their bar heights. Which state has the maximum number of beneficiaries?
[Hint: Use bar method of pyplot]
b. Make a pie chart that depicts the ratio among different modes of benefits.
[Hint: Use pie method of pyplot]

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
dfprisoners = pd.read_csv("prisoners.csv")

In [6]:
dfprisoners.shape

(35, 6)

In [7]:
dfprisoners.head(5)

,STATE/UT,YEAR,No. of Inmates benefitted by Elementary Education,No. of Inmates benefitted by Adult Education,No. of Inmates benefitted by Higher Education,No. of Inmates benefitted by Computer Course
0,Andhra Pradesh,2013,9480,13758,672,170
1,Arunachal Pradesh,2013,0,0,0,0
2,Assam,2013,676,750,14,30
3,Bihar,2013,1693,3013,125,1417
4,Chhatisgarh,2013,1664,1803,192,103

In [4]:
dfprisoners.shape

(35, 6)